Documents/Тур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Тур</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Игры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сезоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СыграноИгр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Игры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хозяин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гость</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сыгран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МЗ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Тур/Forms/ФормаДокумента/Ext/Form/Module.bsl
Перем ОбластьСтрока5;
Перем ЦветПобеда, ЦветНичьи, ЦветПораж;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьСлудующийНесыгранныйМатч()
КонецПроцедуры

&НаКлиенте
Процедура кнСчетХозяинГость(Команда)
	
	ИмяКн		= Команда.Имя;
	Если Найти(ИмяКн, "Хозяин") > 0 Тогда
		ЭтаФорма.МЗ = Число(Сред(ИмяКн, 7, 1));
		флВвод = Истина
	ИначеЕсли Найти(ИмяКн, "Гость") > 0 Тогда
		ЭтаФорма.МП = Число(Сред(ИмяКн, 6, 1));
	КонецЕсли;	
	
	ЭтаФорма.Счет = Формат(ЭтаФорма.МЗ,"ЧЦ=1; ЧН=") + "-" + Формат(ЭтаФорма.МП,"ЧЦ=1; ЧН=");
	Если Найти(ИмяКн, "Гость") > 0 Тогда
		Если флВвод Тогда
			Ввод(Неопределено)
		КонецЕсли;	
		флВвод = Ложь
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Ввод(Команда)
	
	Счет			= ЭтаФорма.Счет;
	ТекСтрока		= Элементы.Игры.ТекущиеДанные;
	
	флИзменения = Не ТекСтрока.Счет = Счет;
	
	ТекСтрока.Счет	= Счет;
	ТекСтрока.МЗ	= ?(ПустаяСтрока(Счет), 0, ЭтаФорма.МЗ);
	ТекСтрока.МП	= ?(ПустаяСтрока(Счет), 0, ЭтаФорма.МП);
	ТекСтрока.Сыгран = НЕ ПустаяСтрока(Счет);
	
	// на следующую строку табличной части
	ПозицияТекущейСтроки = Элементы.Игры.ТекущаяСтрока;
	ПолучитьСлудующийНесыгранныйМатч(ПозицияТекущейСтроки);
	
	Если флИзменения Тогда
		Модифицированность = Истина
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Нет(Команда)
	ЭтаФорма.Счет = "";
	// в табличной части все уберется авт. при наж. кн. "Ввод"
	Ввод(Команда)
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыСтроки(ТекущаяСтрока)
	
	// в ревзизиты, а не в связанные им элементы формы
    ЗаполнитьЗначенияСвойств(ЭтаФорма, ТекущаяСтрока)
	
КонецПроцедуры

&НаКлиенте
Процедура ИгрыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ЗаполнитьРеквизитыСтроки(Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ИгрыПриАктивизацииСтроки(Элемент)
	
	ЗаполнитьРеквизитыСтроки(Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДату(Команда)
	
	ТекСтрока		= Элементы.Игры.ТекущиеДанные;
	ИсходнаяДата	= ТекСтрока.Дата;
	
	ПараметрыФормы = Новый Структура("НоваяДата, Игры", ТекСтрока.Дата, Объект.Игры);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОповещениеОЗакрытии", ЭтотОбъект);
	
	ОткрытьФорму("Документ.Тур.Форма.ФормаУстановкиДаты", ПараметрыФормы, ЭтаФорма,,,,ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИгру(Команда)
	
	НоваяСтрока = Объект.Игры.Добавить();
	
	Попытка
		НоваяСтрока.Дата = Элементы.Игры.ТекущиеДанные.Дата;
		Элементы.Игры.ТекущаяСтрока = НоваяСтрока.НомерСтроки - 1
	Исключение
		НоваяСтрока.Дата = Объект.Дата;
		Элементы.Игры.ТекущаяСтрока = 0
	КонецПопытки;
	
	Элементы.Игры.ТекущийЭлемент = ЭтаФорма.Элементы.ИгрыХозяин
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИгру(Команда)
	
	Объект.Игры.Удалить(Элементы.Игры.ТекущиеДанные)
	
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	
	текСостояниеТП = Элементы.Игры.ТолькоПросмотр;
	Элементы.Игры.ТолькоПросмотр = Не	текСостояниеТП;
	Элементы.Игры.КоманднаяПанель.ПодчиненныеЭлементы.ИгрыРедактировать.Пометка = текСостояниеТП;
	
	Элементы.Игры.КоманднаяПанель.ПодчиненныеЭлементы.ИгрыДобавить.Видимость = текСостояниеТП;
	Элементы.Игры.КоманднаяПанель.ПодчиненныеЭлементы.ИгрыУдалить.Видимость = текСостояниеТП;
	
КонецПроцедуры

&НаКлиенте
Процедура ИгрыХозяинПриИзменении(Элемент)
	Элементы.Игры.ТекущийЭлемент = ЭтаФорма.Элементы.ИгрыГость;	// поле формы с именем
КонецПроцедуры

&НаКлиенте
Процедура ИграИнфо(Команда)
	
	// вывести информацию взаимоотношений по выбранной паре команд
	СтандартнаяОбработка = Ложь;
	стрЗаголовок = "";

	ТекСтрока	= ЭтаФорма.Элементы.Игры.ТекущиеДанные;
	
	ТабДок = омВызовИзКлиента.обИнфо(ТекСтрока.Хозяин, ТекСтрока.Гость, ТекСтрока.Сыгран, стрЗаголовок);
	
	ТабДок.ОтображатьСетку		= Ложь;
	ТабДок.ОтображатьЗаголовки	= Ложь;
	ТабДок.ТолькоПросмотр		= Истина;
	ТабДок.Показать(стрЗаголовок)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если флИзменения Тогда
		Оповестить("ДокументЗаписан");	// 9 вызовов сервера (62)
		//ОбновитьИнтерфейс();	// 13 вызовов (92)	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСлудующийНесыгранныйМатч(ПозицияТекущейСтроки = -1)

	Для сч = 0 По Объект.Игры.Количество()-1 Цикл
		ПозицияТекущейСтроки = ?(ПозицияТекущейСтроки < Объект.Игры.Количество() - 1, ПозицияТекущейСтроки + 1, 0);
		Если Не Элементы.Игры.ДанныеСтроки(ПозицияТекущейСтроки).Сыгран Тогда
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Элементы.Игры.ТекущаяСтрока = ПозицияТекущейСтроки;
		
КонецПроцедуры // ПолучитьСлудующийНесыгранныйМатч()

&НаКлиенте
Процедура ОповещениеОЗакрытии(парНоваяДата, ПараметрНеЗаполненПриОткрытииФормы) Экспорт
		
	ТекСтрока		= Элементы.Игры.ТекущиеДанные;
	
	Если ТипЗнч(парНоваяДата) = Тип("Дата") И ЗначениеЗаполнено(парНоваяДата) И Не парНоваяДата = ТекСтрока.Дата Тогда
		
		ТекСтрока.Дата = парНоваяДата;
		
		Объект.Игры.Сортировать("Дата,НомерСтроки");
		Элементы.Игры.Обновить();
		
		флИзменения = Истина;
		Модифицированность = Истина
		
	КонецЕсли;	
	
КонецПроцедуры

флВвод = Ложь
